from zade import Alternative, Constraint, Goal

comp_alts = [
    Alternative("Ноутбук", 
        [
            Constraint("Бюджет до 150к", 0.8, 0.6),     
            Constraint("Производительность", 0.7, 0.9),  
            Constraint("Вес", 0.9, 0.4)          
        ],
        [
            Goal("Играть в любом месте", 0.85, 0.8),   
            Goal("Макс. графика", 0.6, 0.5),           
            Goal("Долгая автономность", 0.4, 0.3)      
        ]
    ),
    
    Alternative("Моноблок", 
        [
            Constraint("Бюджет до 150к", 0.6, 0.6),   
            Constraint("Производительность", 0.8, 0.9),
            Constraint("Вес", 0.1, 0.4)        
        ],
        [
            Goal("Играть в любом месте", 0.3, 0.8),  
            Goal("Макс. графика", 0.75, 0.5),        
            Goal("Долгая автономность", 0.0, 0.3)    
        ]
    ),
    
    Alternative("Компактный ПК + портативный монитор", 
        [
            Constraint("Бюджет до 150к", 0.7, 0.6),    
            Constraint("Производительность", 0.95, 0.9),
            Constraint("Вес", 0.5, 0.4)         
        ],
        [
            Goal("Играть в любом месте", 0.6, 0.8),    
            Goal("Макс. графика", 0.9, 0.5),           
            Goal("Долгая автономность", 0.2, 0.3)      
        ]
    ),
    
    Alternative("Игровой планшет", 
        [
            Constraint("Бюджет до 150к", 0.4, 0.6),    
            Constraint("Производительность", 0.65, 0.9),
            Constraint("Вес", 0.95, 0.4)        
        ],
        [
            Goal("Играть в любом месте", 0.7, 0.8),   
            Goal("Макс. графика", 0.5, 0.5),          
            Goal("Долгая автономность", 0.6, 0.3)     
        ]
    ),
]

qual_alts = [
    Alternative("Data Science на языке Python от РЭУ Плеханова", 
        [
            Constraint("Стоимость", 0.8, 0.8),     
            Constraint("Время", 0.95, 0.1),  
            Constraint("Местоположение", 0.7, 0.5),
            Constraint("Репутация курса", 0.2, 0.85),
            Constraint("Требуемые знания", 0.4, 0.9),
            Constraint("Применимость знаний", 0.8, 0.95),
        ],
        [
            Goal("Получить работу", 0.1, 0.95),   
            Goal("Улучшить проф. навыки", 0.6, 0.6),           
        ]
    ),

    Alternative("Java: Spring Framework от ИТМО", 
        [
            Constraint("Стоимость", 0.8, 0.8),     
            Constraint("Время", 0.8, 0.1),  
            Constraint("Местоположение", 0.95, 0.5),
            Constraint("Репутация курса", 0.8, 0.85),
            Constraint("Требуемые знания", 0.6, 0.9),
            Constraint("Применимость знаний", 0.05, 0.95),
        ],
        [
            Goal("Получить работу", 0.65, 0.95),   
            Goal("Улучшить проф. навыки", 0.7, 0.6),           
        ]
    ),

    Alternative("Фреймворк Flask от Московской академии", 
        [
            Constraint("Стоимость", 0.8, 0.8),     
            Constraint("Время", 0.4, 0.1),  
            Constraint("Местоположение", 0.0, 0.5),
            Constraint("Репутация курса", 0.5, 0.85),
            Constraint("Требуемые знания", 0.98, 0.9),
            Constraint("Применимость знаний", 0.05, 0.95),
        ],
        [
            Goal("Получить работу", 0.05, 0.95),   
            Goal("Улучшить проф. навыки", 0.4, 0.6),           
        ]
    ),

    Alternative("Docker от ИТМО", 
        [
            Constraint("Стоимость", 0.9, 0.8),     
            Constraint("Время", 0.7, 0.1),  
            Constraint("Местоположение", 0.95, 0.5),
            Constraint("Репутация курса", 0.8, 0.85),
            Constraint("Требуемые знания", 0.9, 0.9),
            Constraint("Применимость знаний", 0.95, 0.95),
        ],
        [
            Goal("Получить работу", 0.8, 0.95),   
            Goal("Улучшить проф. навыки", 0.8, 0.6),           
        ]
    ),
]
